"use strict";

function _classCallCheck(instance, Constructor) { if (!(instance instanceof Constructor)) { throw new TypeError("Cannot call a class as a function"); } }

function _defineProperties(target, props) { for (var i = 0; i < props.length; i++) { var descriptor = props[i]; descriptor.enumerable = descriptor.enumerable || false; descriptor.configurable = true; if ("value" in descriptor) descriptor.writable = true; Object.defineProperty(target, descriptor.key, descriptor); } }

function _createClass(Constructor, protoProps, staticProps) { if (protoProps) _defineProperties(Constructor.prototype, protoProps); if (staticProps) _defineProperties(Constructor, staticProps); return Constructor; }

$(document).ready(function () {
  //burger
  if (document.querySelector('.js-burger')) {
    $('.js-burger').click(function () {
      if ($(this).hasClass('active')) {
        $(this).removeClass('active');
        $('.js-nav').removeClass('active');
        $('.main').removeClass('opacity');
        $('body').removeClass('overflow');
        $('html').removeClass('overflow');
      } else {
        $(this).addClass('active');
        $('.js-nav').addClass('active');
        $('.main').addClass('opacity');
        $('body').addClass('overflow');
        $('html').addClass('overflow');
      }
    });
  }
});
$(document).ready(function () {//     $('.region').each((id, el) => {
  //         $(el).attr('data-region', id);
  //     });
  //     const regions = Array.from($('.region').map(function() {
  //         const position = this.getBBox();
  //         return { left: position.x, top: position.y, right: position.x + position.width, bottom: position.y + position.height, id: $(this).data('region'), el: $(this)};
  //     }));
  //     function getRegion(left, top) {
  //         return regions.find(function(element, index, array) {
  //             return (left >= element.left && left <= element.right) && (top > element.top && top < element.bottom);
  //         })
  //     };
  //     $('svg ellipse, svg circle').each(function() {
  //         const currentPos = this.getBBox();
  //         const region = getRegion(currentPos.x, currentPos.y) ? getRegion(currentPos.x, currentPos.y).id : null
  //         $(this).attr('data-region', region);
  //     })
  //     // TEST 
  // $('svg path').click(function() {
  //     const region = $(this).data('region')
  //     $(`svg circle[data-region=${region}], svg ellipse[data-region=${region}]`).hide();
  // })
  // var regionsOld = {
  //     "regions": {
  //       "region": [
  //         {
  //           "-name": "Автономная Республика Крым",
  //           "city": [
  //             {
  //               "-lat": "44.4197222",
  //               "-lon": "34.0430556",
  //               "-name": "Алупка"
  //             },
  //             {
  //               "-lat": "44.6637211",
  //               "-lon": "34.405013",
  //               "-name": "Алушта"
  //             },
  //             {
  //               "-lat": "46.1072222",
  //               "-lon": "33.6933333",
  //               "-name": "Армянск"
  //             },
  //             {
  //               "-lat": "44.7527778",
  //               "-lon": "33.8608333",
  //               "-name": "Бахчисарай"
  //             },
  //             {
  //               "-lat": "45.0544444",
  //               "-lon": "34.6022222",
  //               "-name": "Белогорск"
  //             },
  //             {
  //               "-lat": "45.7086111",
  //               "-lon": "34.3933333",
  //               "-name": "Джанкой"
  //             },
  //             {
  //               "-lat": "45.2036111",
  //               "-lon": "33.3613889",
  //               "-name": "Евпатория"
  //             },
  //             {
  //               "-lat": "45.33786",
  //               "-lon": "36.458401",
  //               "-name": "Керчь"
  //             },
  //             {
  //               "-lat": "45.962849",
  //               "-lon": "33.787121",
  //               "-name": "Красноперекопск"
  //             },
  //             {
  //               "-lat": "45.1336111",
  //               "-lon": "33.5772222",
  //               "-name": "Саки"
  //             },
  //             {
  //               "-lat": "44.60000001",
  //               "-lon": "33.533333343333",
  //               "-name": "Севастополь"
  //             },
  //             {
  //               "-lat": "44.9480556",
  //               "-lon": "34.1041667",
  //               "-name": "Симферополь"
  //             },
  //             {
  //               "-lat": "45.0291667",
  //               "-lon": "35.0886111",
  //               "-name": "Старый Крым"
  //             },
  //             {
  //               "-lat": "44.858799",
  //               "-lon": "34.974979",
  //               "-name": "Судак"
  //             },
  //             {
  //               "-lat": "45.0488889",
  //               "-lon": "35.3791667",
  //               "-name": "Феодосия"
  //             },
  //             {
  //               "-lat": "45.4281023",
  //               "-lon": "35.8165187",
  //               "-name": "Щёлкино"
  //             },
  //             {
  //               "-lat": "44.4994444",
  //               "-lon": "34.1552778",
  //               "-name": "Ялта"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Винницкая область",
  //           "city": [
  //             {
  //               "-lat": "49.630283",
  //               "-lon": "27.001648",
  //               "-name": "Бар"
  //             },
  //             {
  //               "-lat": "48.368954",
  //               "-lon": "29.5331654",
  //               "-name": "Бершадь"
  //             },
  //             {
  //               "-lat": "49.2333333",
  //               "-lon": "28.4833333",
  //               "-name": "Винница"
  //             },
  //             {
  //               "-lat": "48.8094444",
  //               "-lon": "29.3905556",
  //               "-name": "Гайсин"
  //             },
  //             {
  //               "-lat": "49.038349",
  //               "-lon": "28.10556",
  //               "-name": "Жмеринка"
  //             },
  //             {
  //               "-lat": "49.711769",
  //               "-lon": "28.842859",
  //               "-name": "Казатин"
  //             },
  //             {
  //               "-lat": "49.4472222",
  //               "-lon": "28.5230556",
  //               "-name": "Калиновка"
  //             },
  //             {
  //               "-lat": "48.676151",
  //               "-lon": "29.262541",
  //               "-name": "Ладыжин"
  //             },
  //             {
  //               "-lat": "48.45",
  //               "-lon": "27.8",
  //               "-name": "Могилёв-Подольский"
  //             },
  //             {
  //               "-lat": "48.9726621",
  //               "-lon": "28.835666",
  //               "-name": "Немиров"
  //             },
  //             {
  //               "-lat": "49.4833333",
  //               "-lon": "29.2666667",
  //               "-name": "Погребище"
  //             },
  //             {
  //               "-lat": "48.68",
  //               "-lon": "28.87",
  //               "-name": "Тульчин"
  //             },
  //             {
  //               "-lat": "49.563469",
  //               "-lon": "27.959379",
  //               "-name": "Хмельник"
  //             },
  //             {
  //               "-lat": "48.73761",
  //               "-lon": "28.08688",
  //               "-name": "Шаргород"
  //             },
  //             {
  //               "-lat": "49.9572775",
  //               "-lon": "26.2290711",
  //               "-name": "Ямполь"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Волынская область",
  //           "city": [
  //             {
  //               "-lat": "50.3505636",
  //               "-lon": "25.1007738",
  //               "-name": "Берестечко"
  //             },
  //             {
  //               "-lat": "50.853578",
  //               "-lon": "24.311783",
  //               "-name": "Владимир-Волынский"
  //             },
  //             {
  //               "-lat": "50.500622",
  //               "-lon": "24.767559",
  //               "-name": "Горохов"
  //             },
  //             {
  //               "-lat": "51.6241667",
  //               "-lon": "24.9605556",
  //               "-name": "Камень-Каширский"
  //             },
  //             {
  //               "-lat": "50.833621",
  //               "-lon": "25.460706",
  //               "-name": "Киверцы"
  //             },
  //             {
  //               "-lat": "51.212898",
  //               "-lon": "24.71343",
  //               "-name": "Ковель"
  //             },
  //             {
  //               "-lat": "50.75",
  //               "-lon": "25.3358333",
  //               "-name": "Луцк"
  //             },
  //             {
  //               "-lat": "51.2230556",
  //               "-lon": "24.0377778",
  //               "-name": "Любомль"
  //             },
  //             {
  //               "-lat": "50.7333333",
  //               "-lon": "24.1666667",
  //               "-name": "Нововолынск"
  //             },
  //             {
  //               "-lat": "50.915901",
  //               "-lon": "25.268551",
  //               "-name": "Рожище"
  //             },
  //             {
  //               "-lat": "50.86",
  //               "-lon": "24.15",
  //               "-name": "Устилуг"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Днепропетровская область",
  //           "city": [
  //             {
  //               "-lat": "47.65815",
  //               "-lon": "33.697819",
  //               "-name": "Апостолово"
  //             },
  //             {
  //               "-lat": "48.6561111",
  //               "-lon": "34.3283333",
  //               "-name": "Верхнеднепровск"
  //             },
  //             {
  //               "-lat": "48.4833333",
  //               "-lon": "34.0166667",
  //               "-name": "Вольногорск"
  //             },
  //             {
  //               "-lat": "48.5166667",
  //               "-lon": "34.6166667",
  //               "-name": "Днепродзержинск"
  //             },
  //             {
  //               "-lat": "48.45",
  //               "-lon": "34.9833333",
  //               "-name": "Днепропетровск"
  //             },
  //             {
  //               "-lat": "48.35",
  //               "-lon": "33.5",
  //               "-name": "Жёлтые Воды"
  //             },
  //             {
  //               "-lat": "47.899726",
  //               "-lon": "33.379534",
  //               "-name": "Кривой Рог"
  //             },
  //             {
  //               "-lat": "47.6397222",
  //               "-lon": "34.6363889",
  //               "-name": "Марганец"
  //             },
  //             {
  //               "-lat": "47.5666667",
  //               "-lon": "34.4",
  //               "-name": "Никополь"
  //             },
  //             {
  //               "-lat": "48.6333333",
  //               "-lon": "35.2166667",
  //               "-name": "Новомосковск"
  //             },
  //             {
  //               "-lat": "44.9643961",
  //               "-lon": "35.3569007",
  //               "-name": "Орджоникидзе"
  //             },
  //             {
  //               "-lat": "48.533939",
  //               "-lon": "35.869282",
  //               "-name": "Павлоград"
  //             },
  //             {
  //               "-lat": "49.016251",
  //               "-lon": "35.371681",
  //               "-name": "Перещепино"
  //             },
  //             {
  //               "-lat": "48.3463889",
  //               "-lon": "36.4044444",
  //               "-name": "Першотравенск"
  //             },
  //             {
  //               "-lat": "49.5355598",
  //               "-lon": "25.5276081",
  //               "-name": "Подгородное"
  //             },
  //             {
  //               "-lat": "48.4113889",
  //               "-lon": "33.7105556",
  //               "-name": "Пятихатки"
  //             },
  //             {
  //               "-lat": "48.3177778",
  //               "-lon": "35.5119444",
  //               "-name": "Синельниково"
  //             },
  //             {
  //               "-lat": "48.5402778",
  //               "-lon": "29.9677778",
  //               "-name": "Терновка"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Донецкая область",
  //           "city": [
  //             {
  //               "-lat": "48.1333333",
  //               "-lon": "37.7333333",
  //               "-name": "Авдеевка"
  //             },
  //             {
  //               "-lat": "48.599072",
  //               "-lon": "37.999241",
  //               "-name": "Артёмовск"
  //             },
  //             {
  //               "-lat": "47.596119",
  //               "-lon": "37.490429",
  //               "-name": "Волноваха"
  //             },
  //             {
  //               "-lat": "48.346432",
  //               "-lon": "38.059513",
  //               "-name": "Горловка"
  //             },
  //             {
  //               "-lat": "48.4",
  //               "-lon": "37.8333333",
  //               "-name": "Дзержинск"
  //             },
  //             {
  //               "-lat": "48.3333333",
  //               "-lon": "38.4",
  //               "-name": "Дебальцево"
  //             },
  //             {
  //               "-lat": "48.32357",
  //               "-lon": "37.291854",
  //               "-name": "Димитров"
  //             },
  //             {
  //               "-lat": "48.4691324",
  //               "-lon": "37.0871223",
  //               "-name": "Доброполье"
  //             },
  //             {
  //               "-lat": "47.770821",
  //               "-lon": "37.684361",
  //               "-name": "Докучаевск"
  //             },
  //             {
  //               "-lat": "48.0027778",
  //               "-lon": "37.8052778",
  //               "-name": "Донецк"
  //             },
  //             {
  //               "-lat": "48.6166667",
  //               "-lon": "37.5333333",
  //               "-name": "Дружковка"
  //             },
  //             {
  //               "-lat": "48.2166667",
  //               "-lon": "38.2",
  //               "-name": "Енакиево"
  //             },
  //             {
  //               "-lat": "48.1462985",
  //               "-lon": "38.2540176",
  //               "-name": "Ждановка"
  //             },
  //             {
  //               "-lat": "48.0166667",
  //               "-lon": "38.2666667",
  //               "-name": "Зугрэс"
  //             },
  //             {
  //               "-lat": "48.15",
  //               "-lon": "38.3666667",
  //               "-name": "Кировское"
  //             },
  //             {
  //               "-lat": "48.736462",
  //               "-lon": "37.57164",
  //               "-name": "Краматорск"
  //             },
  //             {
  //               "-lat": "48.2827778",
  //               "-lon": "37.1827778",
  //               "-name": "Красноармейск"
  //             },
  //             {
  //               "-lat": "48.984211",
  //               "-lon": "37.810329",
  //               "-name": "Красный Лиман"
  //             },
  //             {
  //               "-lat": "48.51545",
  //               "-lon": "37.703629",
  //               "-name": "Константиновка"
  //             },
  //             {
  //               "-lat": "47.1166667",
  //               "-lon": "37.55",
  //               "-name": "Мариуполь"
  //             },
  //             {
  //               "-lat": "48.076179",
  //               "-lon": "38.068427",
  //               "-name": "Макеевка"
  //             },
  //             {
  //               "-lat": "48.2045408",
  //               "-lon": "37.336821",
  //               "-name": "Новогродовка"
  //             },
  //             {
  //               "-lat": "48.144671",
  //               "-lon": "37.297897",
  //               "-name": "Селидово"
  //             },
  //             {
  //               "-lat": "48.846851",
  //               "-lon": "37.57954",
  //               "-name": "Славянск"
  //             },
  //             {
  //               "-lat": "48.0282789",
  //               "-lon": "38.7656122",
  //               "-name": "Снежное"
  //             },
  //             {
  //               "-lat": "48.6833333",
  //               "-lon": "38.1",
  //               "-name": "Соледар"
  //             },
  //             {
  //               "-lat": "48.0166667",
  //               "-lon": "38.6333333",
  //               "-name": "Торез"
  //             },
  //             {
  //               "-lat": "47.7833333",
  //               "-lon": "37.25",
  //               "-name": "Угледар"
  //             },
  //             {
  //               "-lat": "48.037411",
  //               "-lon": "38.160301",
  //               "-name": "Харцызск"
  //             },
  //             {
  //               "-lat": "48.0333333",
  //               "-lon": "38.4833333",
  //               "-name": "Шахтёрск"
  //             },
  //             {
  //               "-lat": "48.1221425",
  //               "-lon": "37.8765944",
  //               "-name": "Ясиноватая"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Житомирская область",
  //           "city": [
  //             {
  //               "-lat": "50.0166667",
  //               "-lon": "29.0166667",
  //               "-name": "Андрушёвка"
  //             },
  //             {
  //               "-lat": "50.30204",
  //               "-lon": "27.67634",
  //               "-name": "Барановка"
  //             },
  //             {
  //               "-lat": "49.903381",
  //               "-lon": "28.599251",
  //               "-name": "Бердичев"
  //             },
  //             {
  //               "-lat": "50.259749",
  //               "-lon": "28.676248",
  //               "-name": "Житомир"
  //             },
  //             {
  //               "-lat": "50.95",
  //               "-lon": "28.6333333",
  //               "-name": "Коростень"
  //             },
  //             {
  //               "-lat": "50.316639",
  //               "-lon": "29.06653",
  //               "-name": "Коростышев"
  //             },
  //             {
  //               "-lat": "50.77121",
  //               "-lon": "29.25297",
  //               "-name": "Малин"
  //             },
  //             {
  //               "-lat": "50.59256",
  //               "-lon": "27.62348",
  //               "-name": "Новоград-Волынский"
  //             },
  //             {
  //               "-lat": "51.327251",
  //               "-lon": "28.818979",
  //               "-name": "Овруч"
  //             },
  //             {
  //               "-lat": "50.4947222",
  //               "-lon": "29.2333333",
  //               "-name": "Радомышль"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Закарпатская область",
  //           "city": [
  //             {
  //               "-lat": "48.2",
  //               "-lon": "22.6333333",
  //               "-name": "Берегово"
  //             },
  //             {
  //               "-lat": "48.138142",
  //               "-lon": "23.041519",
  //               "-name": "Виноградов"
  //             },
  //             {
  //               "-lat": "48.310911",
  //               "-lon": "23.037711",
  //               "-name": "Иршава"
  //             },
  //             {
  //               "-lat": "48.442411",
  //               "-lon": "22.723352",
  //               "-name": "Мукачево"
  //             },
  //             {
  //               "-lat": "48.7341667",
  //               "-lon": "22.4741667",
  //               "-name": "Перечин"
  //             },
  //             {
  //               "-lat": "48.060829",
  //               "-lon": "24.205059",
  //               "-name": "Рахов"
  //             },
  //             {
  //               "-lat": "48.5472222",
  //               "-lon": "22.9861111",
  //               "-name": "Свалява"
  //             },
  //             {
  //               "-lat": "48.0113889",
  //               "-lon": "23.5722222",
  //               "-name": "Тячев"
  //             },
  //             {
  //               "-lat": "48.6166667",
  //               "-lon": "22.3",
  //               "-name": "Ужгород"
  //             },
  //             {
  //               "-lat": "48.1813889",
  //               "-lon": "23.2977778",
  //               "-name": "Хуст"
  //             },
  //             {
  //               "-lat": "48.4333333",
  //               "-lon": "22.2",
  //               "-name": "Чоп"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Запорожская область",
  //           "city": [
  //             {
  //               "-lat": "46.748581",
  //               "-lon": "36.809502",
  //               "-name": "Бердянск"
  //             },
  //             {
  //               "-lat": "47.433708",
  //               "-lon": "35.27816",
  //               "-name": "Васильевка"
  //             },
  //             {
  //               "-lat": "47.9419444",
  //               "-lon": "35.4280556",
  //               "-name": "Вольнянск"
  //             },
  //             {
  //               "-lat": "47.658562",
  //               "-lon": "36.252918",
  //               "-name": "Гуляйполе"
  //             },
  //             {
  //               "-lat": "47.3840983",
  //               "-lon": "34.98121",
  //               "-name": "Днепрорудное"
  //             },
  //             {
  //               "-lat": "47.853748",
  //               "-lon": "35.157139",
  //               "-name": "Запорожье"
  //             },
  //             {
  //               "-lat": "47.488911",
  //               "-lon": "34.400761",
  //               "-name": "Каменка-Днепровская"
  //             },
  //             {
  //               "-lat": "46.847839",
  //               "-lon": "35.364979",
  //               "-name": "Мелитополь"
  //             },
  //             {
  //               "-lat": "47.206982",
  //               "-lon": "35.59618",
  //               "-name": "Молочанск"
  //             },
  //             {
  //               "-lat": "47.5666667",
  //               "-lon": "35.7833333",
  //               "-name": "Орехов"
  //             },
  //             {
  //               "-lat": "47.47728",
  //               "-lon": "36.25626",
  //               "-name": "Пологи"
  //             },
  //             {
  //               "-lat": "46.7333333",
  //               "-lon": "36.35",
  //               "-name": "Приморск"
  //             },
  //             {
  //               "-lat": "47.25",
  //               "-lon": "35.7",
  //               "-name": "Токмак"
  //             },
  //             {
  //               "-lat": "47.4979877",
  //               "-lon": "34.6565334",
  //               "-name": "Энергодар"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Ивано-Франковская область",
  //           "city": [
  //             {
  //               "-lat": "49.070011",
  //               "-lon": "23.864719",
  //               "-name": "Болехов"
  //             },
  //             {
  //               "-lat": "49.263802",
  //               "-lon": "24.634211",
  //               "-name": "Бурштын"
  //             },
  //             {
  //               "-lat": "49.1247222",
  //               "-lon": "24.7286111",
  //               "-name": "Галич"
  //             },
  //             {
  //               "-lat": "48.6675",
  //               "-lon": "25.5002778",
  //               "-name": "Городенка"
  //             },
  //             {
  //               "-lat": "51.79",
  //               "-lon": "33.76",
  //               "-name": "Долина"
  //             },
  //             {
  //               "-lat": "48.9166667",
  //               "-lon": "24.7166667",
  //               "-name": "Ивано-Франковск"
  //             },
  //             {
  //               "-lat": "49.050465",
  //               "-lon": "24.374117",
  //               "-name": "Калуш"
  //             },
  //             {
  //               "-lat": "48.53146",
  //               "-lon": "25.039709",
  //               "-name": "Коломыя"
  //             },
  //             {
  //               "-lat": "48.315",
  //               "-lon": "25.0952778",
  //               "-name": "Косов"
  //             },
  //             {
  //               "-lat": "48.6333333",
  //               "-lon": "24.5833333",
  //               "-name": "Надворная"
  //             },
  //             {
  //               "-lat": "49.411449",
  //               "-lon": "24.62051",
  //               "-name": "Рогатин"
  //             },
  //             {
  //               "-lat": "48.45",
  //               "-lon": "25.5666667",
  //               "-name": "Снятын"
  //             },
  //             {
  //               "-lat": "48.9008333",
  //               "-lon": "24.8491667",
  //               "-name": "Тысменица"
  //             },
  //             {
  //               "-lat": "48.8666667",
  //               "-lon": "25.0",
  //               "-name": "Тлумач"
  //             },
  //             {
  //               "-lat": "48.449523",
  //               "-lon": "24.557508",
  //               "-name": "Яремче"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Киевская область",
  //           "city": [
  //             {
  //               "-lat": "49.7988889",
  //               "-lon": "30.1152778",
  //               "-name": "Белая Церковь"
  //             },
  //             {
  //               "-lat": "50.3197222",
  //               "-lon": "31.47",
  //               "-name": "Березань"
  //             },
  //             {
  //               "-lat": "49.541031",
  //               "-lon": "30.88073",
  //               "-name": "Богуслав"
  //             },
  //             {
  //               "-lat": "50.350491",
  //               "-lon": "30.960739",
  //               "-name": "Борисполь"
  //             },
  //             {
  //               "-lat": "49.323518",
  //               "-lon": "30.700165",
  //               "-name": "Боярка"
  //             },
  //             {
  //               "-lat": "50.5166667",
  //               "-lon": "30.8166667",
  //               "-name": "Бровары"
  //             },
  //             {
  //               "-lat": "50.5569165",
  //               "-lon": "30.2230733",
  //               "-name": "Буча"
  //             },
  //             {
  //               "-lat": "50.178959",
  //               "-lon": "30.32715",
  //               "-name": "Васильков"
  //             },
  //             {
  //               "-lat": "50.4377778",
  //               "-lon": "33.3822222",
  //               "-name": "Вишнёвое"
  //             },
  //             {
  //               "-lat": "50.5833333",
  //               "-lon": "30.5",
  //               "-name": "Вышгород"
  //             },
  //             {
  //               "-lat": "50.5166667",
  //               "-lon": "30.25",
  //               "-name": "Ирпень"
  //             },
  //             {
  //               "-lat": "49.85722",
  //               "-lon": "30.82032",
  //               "-name": "Кагарлык"
  //             },
  //             {
  //               "-lat": "50.584981",
  //               "-lon": "30.235748",
  //               "-name": "Киев"
  //             },
  //             {
  //               "-lat": "49.661022",
  //               "-lon": "30.98458",
  //               "-name": "Мироновка"
  //             },
  //             {
  //               "-lat": "50.105728",
  //               "-lon": "30.630699",
  //               "-name": "Обухов"
  //             },
  //             {
  //               "-lat": "50.070141",
  //               "-lon": "31.45775",
  //               "-name": "Переяслав-Хмельницкий"
  //             },
  //             {
  //               "-lat": "51.4977778",
  //               "-lon": "24.1180556",
  //               "-name": "Припять"
  //             },
  //             {
  //               "-lat": "49.972801",
  //               "-lon": "31.04777",
  //               "-name": "Ржищев"
  //             },
  //             {
  //               "-lat": "49.73719",
  //               "-lon": "29.66901",
  //               "-name": "Сквира"
  //             },
  //             {
  //               "-lat": "51.523777",
  //               "-lon": "30.768559",
  //               "-name": "Славутич"
  //             },
  //             {
  //               "-lat": "49.56065",
  //               "-lon": "30.510309",
  //               "-name": "Тараща"
  //             },
  //             {
  //               "-lat": "49.370575",
  //               "-lon": "29.680221",
  //               "-name": "Тетиев"
  //             },
  //             {
  //               "-lat": "49.820228",
  //               "-lon": "30.438929",
  //               "-name": "Узин"
  //             },
  //             {
  //               "-lat": "50.1530861",
  //               "-lon": "30.7434917",
  //               "-name": "Украинка"
  //             },
  //             {
  //               "-lat": "50.0833333",
  //               "-lon": "29.9166667",
  //               "-name": "Фастов"
  //             },
  //             {
  //               "-lat": "51.2666667",
  //               "-lon": "30.2166667",
  //               "-name": "Чернобыль"
  //             },
  //             {
  //               "-lat": "50.244949",
  //               "-lon": "31.796261",
  //               "-name": "Яготин"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Кировоградская область",
  //           "city": [
  //             {
  //               "-lat": "48.6666667",
  //               "-lon": "33.1166667",
  //               "-name": "Александрия"
  //             },
  //             {
  //               "-lat": "48.050861",
  //               "-lon": "32.16589",
  //               "-name": "Бобринец"
  //             },
  //             {
  //               "-lat": "48.3333333",
  //               "-lon": "29.8666667",
  //               "-name": "Гайворон"
  //             },
  //             {
  //               "-lat": "48.1108333",
  //               "-lon": "32.7647222",
  //               "-name": "Долинская"
  //             },
  //             {
  //               "-lat": "48.7166667",
  //               "-lon": "32.6666667",
  //               "-name": "Знаменка"
  //             },
  //             {
  //               "-lat": "48.508389",
  //               "-lon": "32.264801",
  //               "-name": "Кировоград"
  //             },
  //             {
  //               "-lat": "48.65",
  //               "-lon": "31.6333333",
  //               "-name": "Малая Виска"
  //             },
  //             {
  //               "-lat": "48.7833333",
  //               "-lon": "31.65",
  //               "-name": "Новомиргород"
  //             },
  //             {
  //               "-lat": "48.3155556",
  //               "-lon": "31.5269444",
  //               "-name": "Новоукраинка"
  //             },
  //             {
  //               "-lat": "49.0502778",
  //               "-lon": "33.2419444",
  //               "-name": "Светловодск"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Луганская область",
  //           "city": [
  //             {
  //               "-lat": "48.5861652",
  //               "-lon": "39.1949396",
  //               "-name": "Александровск"
  //             },
  //             {
  //               "-lat": "48.5166667",
  //               "-lon": "38.5833333",
  //               "-name": "Алмазная"
  //             },
  //             {
  //               "-lat": "48.4666667",
  //               "-lon": "38.8",
  //               "-name": "Алчевск"
  //             },
  //             {
  //               "-lat": "48.1166667",
  //               "-lon": "39.0833333",
  //               "-name": "Антрацит"
  //             },
  //             {
  //               "-lat": "48.5133333",
  //               "-lon": "38.6430556",
  //               "-name": "Брянка"
  //             },
  //             {
  //               "-lat": "48.174579",
  //               "-lon": "38.837224",
  //               "-name": "Вахрушево"
  //             },
  //             {
  //               "-lat": "49.1805556",
  //               "-lon": "23.7341667",
  //               "-name": "Горное"
  //             },
  //             {
  //               "-lat": "48.5833333",
  //               "-lon": "38.9333333",
  //               "-name": "Зимогорье"
  //             },
  //             {
  //               "-lat": "48.6928568",
  //               "-lon": "38.5146349",
  //               "-name": "Золотое"
  //             },
  //             {
  //               "-lat": "48.4131636",
  //               "-lon": "38.6204799",
  //               "-name": "Зоринск"
  //             },
  //             {
  //               "-lat": "48.29607",
  //               "-lon": "39.745239",
  //               "-name": "Краснодон"
  //             },
  //             {
  //               "-lat": "48.134041",
  //               "-lon": "38.931419",
  //               "-name": "Красный Луч"
  //             },
  //             {
  //               "-lat": "48.896895",
  //               "-lon": "38.444143",
  //               "-name": "Лисичанск"
  //             },
  //             {
  //               "-lat": "48.573269",
  //               "-lon": "39.355659",
  //               "-name": "Луганск"
  //             },
  //             {
  //               "-lat": "48.4019444",
  //               "-lon": "39.2102778",
  //               "-name": "Лутугино"
  //             },
  //             {
  //               "-lat": "48.07",
  //               "-lon": "38.9",
  //               "-name": "Миусинск"
  //             },
  //             {
  //               "-lat": "48.3444444",
  //               "-lon": "39.6583333",
  //               "-name": "Молодогвардейск"
  //             },
  //             {
  //               "-lat": "48.9666667",
  //               "-lon": "38.35",
  //               "-name": "Новодружеск"
  //             },
  //             {
  //               "-lat": "49.544731",
  //               "-lon": "39.103889",
  //               "-name": "Новопсков"
  //             },
  //             {
  //               "-lat": "48.05",
  //               "-lon": "30.85",
  //               "-name": "Первомайск"
  //             },
  //             {
  //               "-lat": "48.4388889",
  //               "-lon": "38.8194444",
  //               "-name": "Перевальск"
  //             },
  //             {
  //               "-lat": "48.293331",
  //               "-lon": "38.888614",
  //               "-name": "Петровское"
  //             },
  //             {
  //               "-lat": "48.6333333",
  //               "-lon": "38.38",
  //               "-name": "Попасная"
  //             },
  //             {
  //               "-lat": "49.016706",
  //               "-lon": "38.302668",
  //               "-name": "Приволье"
  //             },
  //             {
  //               "-lat": "48.0833333",
  //               "-lon": "39.3666667",
  //               "-name": "Ровеньки"
  //             },
  //             {
  //               "-lat": "49.0166667",
  //               "-lon": "38.3666667",
  //               "-name": "Рубежное"
  //             },
  //             {
  //               "-lat": "49.41011",
  //               "-lon": "38.15258",
  //               "-name": "Сватово"
  //             },
  //             {
  //               "-lat": "48.084549",
  //               "-lon": "39.65163",
  //               "-name": "Свердловск"
  //             },
  //             {
  //               "-lat": "48.950191",
  //               "-lon": "38.497631",
  //               "-name": "Северодонецк"
  //             },
  //             {
  //               "-lat": "49.2666667",
  //               "-lon": "38.9166667",
  //               "-name": "Старобельск"
  //             },
  //             {
  //               "-lat": "48.5666667",
  //               "-lon": "38.65",
  //               "-name": "Стаханов"
  //             },
  //             {
  //               "-lat": "48.3523068",
  //               "-lon": "39.7239205",
  //               "-name": "Суходольск"
  //             },
  //             {
  //               "-lat": "48.737247",
  //               "-lon": "39.2311974",
  //               "-name": "Счастье"
  //             },
  //             {
  //               "-lat": "48.600487",
  //               "-lon": "38.5920825",
  //               "-name": "Теплогорск"
  //             },
  //             {
  //               "-lat": "48.095566",
  //               "-lon": "39.759607",
  //               "-name": "Червонопартизанск"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Львовская область",
  //           "city": [
  //             {
  //               "-lat": "50.380501",
  //               "-lon": "24.01269",
  //               "-name": "Белз"
  //             },
  //             {
  //               "-lat": "49.6331904",
  //               "-lon": "24.2907476",
  //               "-name": "Бобрка"
  //             },
  //             {
  //               "-lat": "49.28476",
  //               "-lon": "23.42137",
  //               "-name": "Борислав"
  //             },
  //             {
  //               "-lat": "50.0833333",
  //               "-lon": "25.15",
  //               "-name": "Броды"
  //             },
  //             {
  //               "-lat": "49.9666667",
  //               "-lon": "24.6333333",
  //               "-name": "Буск"
  //             },
  //             {
  //               "-lat": "50.24",
  //               "-lon": "24.1394444",
  //               "-name": "Великие Мосты"
  //             },
  //             {
  //               "-lat": "49.8233333",
  //               "-lon": "24.5166667",
  //               "-name": "Глиняны"
  //             },
  //             {
  //               "-lat": "49.1666667",
  //               "-lon": "26.5666667",
  //               "-name": "Городок"
  //             },
  //             {
  //               "-lat": "49.5666667",
  //               "-lon": "22.7833333",
  //               "-name": "Добромиль"
  //             },
  //             {
  //               "-lat": "49.34853",
  //               "-lon": "23.51647",
  //               "-name": "Дрогобыч"
  //             },
  //             {
  //               "-lat": "49.8833333",
  //               "-lon": "24.0833333",
  //               "-name": "Дубляны"
  //             },
  //             {
  //               "-lat": "49.3813889",
  //               "-lon": "24.1408333",
  //               "-name": "Жидачов"
  //             },
  //             {
  //               "-lat": "50.0666667",
  //               "-lon": "23.9666667",
  //               "-name": "Жолква"
  //             },
  //             {
  //               "-lat": "49.8083333",
  //               "-lon": "24.9011111",
  //               "-name": "Золочев"
  //             },
  //             {
  //               "-lat": "50.1",
  //               "-lon": "24.35",
  //               "-name": "Каменка-Бугская"
  //             },
  //             {
  //               "-lat": "49.85",
  //               "-lon": "24.0166667",
  //               "-name": "Львов"
  //             },
  //             {
  //               "-lat": "49.7941667",
  //               "-lon": "23.1525",
  //               "-name": "Мостиска"
  //             },
  //             {
  //               "-lat": "49.67",
  //               "-lon": "24.5594444",
  //               "-name": "Перемышляны"
  //             },
  //             {
  //               "-lat": "49.7138889",
  //               "-lon": "23.9108333",
  //               "-name": "Пустомыты"
  //             },
  //             {
  //               "-lat": "50.230431",
  //               "-lon": "23.628309",
  //               "-name": "Рава-Русская"
  //             },
  //             {
  //               "-lat": "50.2827778",
  //               "-lon": "24.6375",
  //               "-name": "Радехов"
  //             },
  //             {
  //               "-lat": "49.6530556",
  //               "-lon": "23.4880556",
  //               "-name": "Рудки"
  //             },
  //             {
  //               "-lat": "49.5166667",
  //               "-lon": "23.2027778",
  //               "-name": "Самбор"
  //             },
  //             {
  //               "-lat": "49.036049",
  //               "-lon": "23.51232",
  //               "-name": "Сколе"
  //             },
  //             {
  //               "-lat": "50.4833333",
  //               "-lon": "24.2833333",
  //               "-name": "Сокаль"
  //             },
  //             {
  //               "-lat": "49.4430556",
  //               "-lon": "23.0033333",
  //               "-name": "Старый Самбор"
  //             },
  //             {
  //               "-lat": "49.256171",
  //               "-lon": "23.850306",
  //               "-name": "Стрый"
  //             },
  //             {
  //               "-lat": "49.2805556",
  //               "-lon": "23.505",
  //               "-name": "Трускавец"
  //             },
  //             {
  //               "-lat": "50.3666667",
  //               "-lon": "23.7444444",
  //               "-name": "Угнев"
  //             },
  //             {
  //               "-lat": "49.5333333",
  //               "-lon": "22.85",
  //               "-name": "Хыров"
  //             },
  //             {
  //               "-lat": "50.3833333",
  //               "-lon": "24.2333333",
  //               "-name": "Червоноград"
  //             },
  //             {
  //               "-lat": "49.942501",
  //               "-lon": "23.390989",
  //               "-name": "Яворов"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Николаевская область",
  //           "city": [
  //             {
  //               "-lat": "47.404331",
  //               "-lon": "32.445301",
  //               "-name": "Баштанка"
  //             },
  //             {
  //               "-lat": "47.587711",
  //               "-lon": "31.336",
  //               "-name": "Вознесенск"
  //             },
  //             {
  //               "-lat": "46.9666667",
  //               "-lon": "32.0",
  //               "-name": "Николаев"
  //             },
  //             {
  //               "-lat": "47.3166667",
  //               "-lon": "31.7833333",
  //               "-name": "Новая Одесса"
  //             },
  //             {
  //               "-lat": "47.6833333",
  //               "-lon": "32.5",
  //               "-name": "Новый Буг"
  //             },
  //             {
  //               "-lat": "46.6166667",
  //               "-lon": "31.55",
  //               "-name": "Очаков"
  //             },
  //             {
  //               "-lat": "48.05",
  //               "-lon": "30.85",
  //               "-name": "Первомайск"
  //             },
  //             {
  //               "-lat": "47.0666667",
  //               "-lon": "32.8166667",
  //               "-name": "Снигирёвка"
  //             },
  //             {
  //               "-lat": "47.8166667",
  //               "-lon": "31.1833333",
  //               "-name": "Южноукраинск"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Одесская область",
  //           "city": [
  //             {
  //               "-lat": "47.7173",
  //               "-lon": "29.975639",
  //               "-name": "Ананьев"
  //             },
  //             {
  //               "-lat": "45.99739",
  //               "-lon": "29.431288",
  //               "-name": "Арциз"
  //             },
  //             {
  //               "-lat": "47.9333333",
  //               "-lon": "29.6166667",
  //               "-name": "Балта"
  //             },
  //             {
  //               "-lat": "46.1833333",
  //               "-lon": "30.3333333",
  //               "-name": "Белгород-Днестровский"
  //             },
  //             {
  //               "-lat": "45.682701",
  //               "-lon": "28.61935",
  //               "-name": "Болград"
  //             },
  //             {
  //               "-lat": "45.3516667",
  //               "-lon": "28.8363889",
  //               "-name": "Измаил"
  //             },
  //             {
  //               "-lat": "46.3020534",
  //               "-lon": "30.6517391",
  //               "-name": "Ильичёвск"
  //             },
  //             {
  //               "-lat": "45.45578",
  //               "-lon": "29.273291",
  //               "-name": "Килия"
  //             },
  //             {
  //               "-lat": "48.093941",
  //               "-lon": "29.13368",
  //               "-name": "Кодыма"
  //             },
  //             {
  //               "-lat": "47.75",
  //               "-lon": "29.5333333",
  //               "-name": "Котовск"
  //             },
  //             {
  //               "-lat": "46.4666667",
  //               "-lon": "30.7333333",
  //               "-name": "Одесса"
  //             },
  //             {
  //               "-lat": "45.841418",
  //               "-lon": "29.62284",
  //               "-name": "Татарбунары"
  //             },
  //             {
  //               "-lat": "46.5",
  //               "-lon": "30.3333333",
  //               "-name": "Теплодар"
  //             },
  //             {
  //               "-lat": "47.8173262",
  //               "-lon": "33.5737487",
  //               "-name": "Южное"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Полтавская область",
  //           "city": [
  //             {
  //               "-lat": "50.3666667",
  //               "-lon": "34.0",
  //               "-name": "Гадяч"
  //             },
  //             {
  //               "-lat": "49.3833333",
  //               "-lon": "33.2833333",
  //               "-name": "Глобино"
  //             },
  //             {
  //               "-lat": "50.116852",
  //               "-lon": "32.44059",
  //               "-name": "Гребёнка"
  //             },
  //             {
  //               "-lat": "50.20955",
  //               "-lon": "34.362345",
  //               "-name": "Зеньков"
  //             },
  //             {
  //               "-lat": "49.45",
  //               "-lon": "35.1333333",
  //               "-name": "Карловка"
  //             },
  //             {
  //               "-lat": "49.073521",
  //               "-lon": "33.4231",
  //               "-name": "Кременчуг"
  //             },
  //             {
  //               "-lat": "49.145439",
  //               "-lon": "34.213638",
  //               "-name": "Кобеляки"
  //             },
  //             {
  //               "-lat": "49.013756",
  //               "-lon": "33.643381",
  //               "-name": "Комсомольск"
  //             },
  //             {
  //               "-lat": "50.36319",
  //               "-lon": "33.253288",
  //               "-name": "Лохвица"
  //             },
  //             {
  //               "-lat": "50.0166667",
  //               "-lon": "33.0",
  //               "-name": "Лубны"
  //             },
  //             {
  //               "-lat": "49.963799",
  //               "-lon": "33.61869",
  //               "-name": "Миргород"
  //             },
  //             {
  //               "-lat": "50.23975",
  //               "-lon": "32.514309",
  //               "-name": "Пирятин"
  //             },
  //             {
  //               "-lat": "49.59269",
  //               "-lon": "34.551159",
  //               "-name": "Полтава"
  //             },
  //             {
  //               "-lat": "49.790279",
  //               "-lon": "33.207809",
  //               "-name": "Хорол"
  //             },
  //             {
  //               "-lat": "50.4",
  //               "-lon": "33.4",
  //               "-name": "Червонозаводское"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Ровенская область",
  //           "city": [
  //             {
  //               "-lat": "51.0",
  //               "-lon": "26.75",
  //               "-name": "Березне"
  //             },
  //             {
  //               "-lat": "50.38738",
  //               "-lon": "25.754559",
  //               "-name": "Дубно"
  //             },
  //             {
  //               "-lat": "51.571209",
  //               "-lon": "26.56805",
  //               "-name": "Дубровица"
  //             },
  //             {
  //               "-lat": "50.5166667",
  //               "-lon": "26.25",
  //               "-name": "Здолбунов"
  //             },
  //             {
  //               "-lat": "50.619129",
  //               "-lon": "27.161869",
  //               "-name": "Корец"
  //             },
  //             {
  //               "-lat": "50.8833333",
  //               "-lon": "26.45",
  //               "-name": "Костополь"
  //             },
  //             {
  //               "-lat": "51.3436553",
  //               "-lon": "25.8490867",
  //               "-name": "Кузнецовск"
  //             },
  //             {
  //               "-lat": "50.3333333",
  //               "-lon": "26.5166667",
  //               "-name": "Острог"
  //             },
  //             {
  //               "-lat": "50.125777",
  //               "-lon": "25.264195",
  //               "-name": "Радивилов"
  //             },
  //             {
  //               "-lat": "50.6166667",
  //               "-lon": "26.25",
  //               "-name": "Ровно"
  //             },
  //             {
  //               "-lat": "51.3372222",
  //               "-lon": "26.6058333",
  //               "-name": "Сарны"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Сумская область",
  //           "city": [
  //             {
  //               "-lat": "50.29855",
  //               "-lon": "34.892052",
  //               "-name": "Ахтырка"
  //             },
  //             {
  //               "-lat": "51.149402",
  //               "-lon": "34.3175225",
  //               "-name": "Белополье"
  //             },
  //             {
  //               "-lat": "51.1978",
  //               "-lon": "33.847351",
  //               "-name": "Бурынь"
  //             },
  //             {
  //               "-lat": "51.6786111",
  //               "-lon": "33.9113889",
  //               "-name": "Глухов"
  //             },
  //             {
  //               "-lat": "51.550121",
  //               "-lon": "33.38279",
  //               "-name": "Кролевец"
  //             },
  //             {
  //               "-lat": "51.237469",
  //               "-lon": "33.21217",
  //               "-name": "Конотоп"
  //             },
  //             {
  //               "-lat": "48.96",
  //               "-lon": "31.52",
  //               "-name": "Лебедин"
  //             },
  //             {
  //               "-lat": "51.337589",
  //               "-lon": "33.87888",
  //               "-name": "Путивль"
  //             },
  //             {
  //               "-lat": "50.743919",
  //               "-lon": "33.475712",
  //               "-name": "Ромны"
  //             },
  //             {
  //               "-lat": "52.1833333",
  //               "-lon": "34.0333333",
  //               "-name": "Середина-Буда"
  //             },
  //             {
  //               "-lat": "50.910561",
  //               "-lon": "34.80566",
  //               "-name": "Сумы"
  //             },
  //             {
  //               "-lat": "50.9599282",
  //               "-lon": "25.55378",
  //               "-name": "Тростянец"
  //             },
  //             {
  //               "-lat": "51.86282",
  //               "-lon": "33.487831",
  //               "-name": "Шостка"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Тернопольская область",
  //           "city": [
  //             {
  //               "-lat": "49.444191",
  //               "-lon": "24.94486",
  //               "-name": "Бережаны"
  //             },
  //             {
  //               "-lat": "48.803181",
  //               "-lon": "26.041809",
  //               "-name": "Борщёв"
  //             },
  //             {
  //               "-lat": "49.05772",
  //               "-lon": "25.401979",
  //               "-name": "Бучач"
  //             },
  //             {
  //               "-lat": "48.65",
  //               "-lon": "25.7333333",
  //               "-name": "Залещики"
  //             },
  //             {
  //               "-lat": "49.6666667",
  //               "-lon": "25.7777778",
  //               "-name": "Збараж"
  //             },
  //             {
  //               "-lat": "49.660696",
  //               "-lon": "25.1434667",
  //               "-name": "Зборов"
  //             },
  //             {
  //               "-lat": "50.099129",
  //               "-lon": "25.7328",
  //               "-name": "Кременец"
  //             },
  //             {
  //               "-lat": "49.8659402",
  //               "-lon": "26.0841931",
  //               "-name": "Лановцы"
  //             },
  //             {
  //               "-lat": "49.0888889",
  //               "-lon": "25.1694444",
  //               "-name": "Монастыриска"
  //             },
  //             {
  //               "-lat": "49.5246859",
  //               "-lon": "26.137326",
  //               "-name": "Подволочиск"
  //             },
  //             {
  //               "-lat": "49.2694444",
  //               "-lon": "25.1361111",
  //               "-name": "Подгайцы"
  //             },
  //             {
  //               "-lat": "50.0",
  //               "-lon": "25.5083333",
  //               "-name": "Почаев"
  //             },
  //             {
  //               "-lat": "49.424214",
  //               "-lon": "25.976246",
  //               "-name": "Скалат"
  //             },
  //             {
  //               "-lat": "49.551361",
  //               "-lon": "25.603979",
  //               "-name": "Тернополь"
  //             },
  //             {
  //               "-lat": "49.29348",
  //               "-lon": "25.699551",
  //               "-name": "Теребовля"
  //             },
  //             {
  //               "-lat": "49.0166667",
  //               "-lon": "25.8",
  //               "-name": "Чортков"
  //             },
  //             {
  //               "-lat": "50.122577",
  //               "-lon": "26.1149716",
  //               "-name": "Шумск"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Харьковская область",
  //           "city": [
  //             {
  //               "-lat": "49.4658333",
  //               "-lon": "36.8677778",
  //               "-name": "Балаклея"
  //             },
  //             {
  //               "-lat": "48.9",
  //               "-lon": "37.0166667",
  //               "-name": "Барвенково"
  //             },
  //             {
  //               "-lat": "50.1654302",
  //               "-lon": "35.5267251",
  //               "-name": "Богодухов"
  //             },
  //             {
  //               "-lat": "49.843601",
  //               "-lon": "35.61388",
  //               "-name": "Валки"
  //             },
  //             {
  //               "-lat": "50.0455556",
  //               "-lon": "37.3905556",
  //               "-name": "Великий Бурлук"
  //             },
  //             {
  //               "-lat": "50.278519",
  //               "-lon": "36.945171",
  //               "-name": "Волчанск"
  //             },
  //             {
  //               "-lat": "50.110668",
  //               "-lon": "36.114361",
  //               "-name": "Дергачи"
  //             },
  //             {
  //               "-lat": "49.701939",
  //               "-lon": "36.355171",
  //               "-name": "Змиев"
  //             },
  //             {
  //               "-lat": "49.2127778",
  //               "-lon": "37.2569444",
  //               "-name": "Изюм"
  //             },
  //             {
  //               "-lat": "49.3666667",
  //               "-lon": "35.45",
  //               "-name": "Красноград"
  //             },
  //             {
  //               "-lat": "49.721901",
  //               "-lon": "37.624329",
  //               "-name": "Купянск"
  //             },
  //             {
  //               "-lat": "48.891684",
  //               "-lon": "36.325786",
  //               "-name": "Лозовая"
  //             },
  //             {
  //               "-lat": "49.95",
  //               "-lon": "35.9166667",
  //               "-name": "Люботин"
  //             },
  //             {
  //               "-lat": "49.8166667",
  //               "-lon": "36.05",
  //               "-name": "Мерефа"
  //             },
  //             {
  //               "-lat": "49.3833333",
  //               "-lon": "36.2166667",
  //               "-name": "Первомайский"
  //             },
  //             {
  //               "-lat": "49.98967",
  //               "-lon": "36.208309",
  //               "-name": "Харьков"
  //             },
  //             {
  //               "-lat": "49.8355556",
  //               "-lon": "36.6863889",
  //               "-name": "Чугуев"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Херсонская область",
  //           "city": [
  //             {
  //               "-lat": "46.843822",
  //               "-lon": "33.4375",
  //               "-name": "Берислав"
  //             },
  //             {
  //               "-lat": "46.171638",
  //               "-lon": "34.80777",
  //               "-name": "Геническ"
  //             },
  //             {
  //               "-lat": "46.5166667",
  //               "-lon": "32.5166667",
  //               "-name": "Голая Пристань"
  //             },
  //             {
  //               "-lat": "46.817388",
  //               "-lon": "33.494325",
  //               "-name": "Каховка"
  //             },
  //             {
  //               "-lat": "46.7666667",
  //               "-lon": "33.3666667",
  //               "-name": "Новая Каховка"
  //             },
  //             {
  //               "-lat": "46.116871",
  //               "-lon": "32.913731",
  //               "-name": "Скадовск"
  //             },
  //             {
  //               "-lat": "46.7528018",
  //               "-lon": "33.4216856",
  //               "-name": "Таврийск"
  //             },
  //             {
  //               "-lat": "46.653368",
  //               "-lon": "32.629424",
  //               "-name": "Херсон"
  //             },
  //             {
  //               "-lat": "46.62",
  //               "-lon": "32.72",
  //               "-name": "Цюрупинск"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Хмельницкая область",
  //           "city": [
  //             {
  //               "-lat": "49.535179",
  //               "-lon": "26.22331",
  //               "-name": "Волочиск"
  //             },
  //             {
  //               "-lat": "49.1666667",
  //               "-lon": "26.5666667",
  //               "-name": "Городок"
  //             },
  //             {
  //               "-lat": "49.267071",
  //               "-lon": "27.440269",
  //               "-name": "Деражня"
  //             },
  //             {
  //               "-lat": "48.8909743",
  //               "-lon": "26.8546608",
  //               "-name": "Дунаевцы"
  //             },
  //             {
  //               "-lat": "50.119221",
  //               "-lon": "26.82629",
  //               "-name": "Изяслав"
  //             },
  //             {
  //               "-lat": "48.6833333",
  //               "-lon": "26.5833333",
  //               "-name": "Каменец-Подольский"
  //             },
  //             {
  //               "-lat": "49.6519444",
  //               "-lon": "26.9705556",
  //               "-name": "Красилов"
  //             },
  //             {
  //               "-lat": "50.3374232",
  //               "-lon": "26.6404529",
  //               "-name": "Нетешин"
  //             },
  //             {
  //               "-lat": "50.122269",
  //               "-lon": "27.511909",
  //               "-name": "Полонное"
  //             },
  //             {
  //               "-lat": "49.0563905",
  //               "-lon": "27.3944506",
  //               "-name": "Славута"
  //             },
  //             {
  //               "-lat": "49.7555556",
  //               "-lon": "27.2208333",
  //               "-name": "Староконстантинов"
  //             },
  //             {
  //               "-lat": "49.4166667",
  //               "-lon": "27.0",
  //               "-name": "Хмельницкий"
  //             },
  //             {
  //               "-lat": "50.179131",
  //               "-lon": "27.07732",
  //               "-name": "Шепетовка"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Черкасская область",
  //           "city": [
  //             {
  //               "-lat": "49.0166667",
  //               "-lon": "31.0666667",
  //               "-name": "Ватутино"
  //             },
  //             {
  //               "-lat": "49.290649",
  //               "-lon": "31.443199",
  //               "-name": "Городище"
  //             },
  //             {
  //               "-lat": "49.245522",
  //               "-lon": "30.11998",
  //               "-name": "Жашков"
  //             },
  //             {
  //               "-lat": "49.075489",
  //               "-lon": "30.967911",
  //               "-name": "Звенигородка"
  //             },
  //             {
  //               "-lat": "49.674271",
  //               "-lon": "32.040421",
  //               "-name": "Золотоноша"
  //             },
  //             {
  //               "-lat": "49.036347",
  //               "-lon": "32.103481",
  //               "-name": "Каменка"
  //             },
  //             {
  //               "-lat": "49.75",
  //               "-lon": "31.4666667",
  //               "-name": "Канев"
  //             },
  //             {
  //               "-lat": "49.421051",
  //               "-lon": "31.268993",
  //               "-name": "Корсунь-Шевченковский"
  //             },
  //             {
  //               "-lat": "48.9909154",
  //               "-lon": "29.8051363",
  //               "-name": "Монастырище"
  //             },
  //             {
  //               "-lat": "49.224621",
  //               "-lon": "31.878401",
  //               "-name": "Смела"
  //             },
  //             {
  //               "-lat": "48.8833333",
  //               "-lon": "30.7",
  //               "-name": "Тальное"
  //             },
  //             {
  //               "-lat": "48.75",
  //               "-lon": "30.2166667",
  //               "-name": "Умань"
  //             },
  //             {
  //               "-lat": "48.8494444",
  //               "-lon": "29.97",
  //               "-name": "Христиновка"
  //             },
  //             {
  //               "-lat": "49.4333333",
  //               "-lon": "32.0666667",
  //               "-name": "Черкассы"
  //             },
  //             {
  //               "-lat": "49.072498",
  //               "-lon": "32.683578",
  //               "-name": "Чигирин"
  //             },
  //             {
  //               "-lat": "49.00349",
  //               "-lon": "31.385559",
  //               "-name": "Шпола"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Черниговская область",
  //           "city": [
  //             {
  //               "-lat": "51.1830556",
  //               "-lon": "32.8297222",
  //               "-name": "Бахмач"
  //             },
  //             {
  //               "-lat": "50.745",
  //               "-lon": "31.3869444",
  //               "-name": "Бобровица"
  //             },
  //             {
  //               "-lat": "51.249451",
  //               "-lon": "32.43034",
  //               "-name": "Борзна"
  //             },
  //             {
  //               "-lat": "51.8905556",
  //               "-lon": "31.5936111",
  //               "-name": "Городня"
  //             },
  //             {
  //               "-lat": "50.9246667",
  //               "-lon": "30.756",
  //               "-name": "Десна"
  //             },
  //             {
  //               "-lat": "50.863918",
  //               "-lon": "32.39307",
  //               "-name": "Ичня"
  //             },
  //             {
  //               "-lat": "51.7754831",
  //               "-lon": "32.2595792",
  //               "-name": "Корюковка"
  //             },
  //             {
  //               "-lat": "51.521759",
  //               "-lon": "32.21888",
  //               "-name": "Мена"
  //             },
  //             {
  //               "-lat": "51.0380556",
  //               "-lon": "31.8861111",
  //               "-name": "Нежин"
  //             },
  //             {
  //               "-lat": "52.0069896",
  //               "-lon": "33.2537069",
  //               "-name": "Новгород-Северский"
  //             },
  //             {
  //               "-lat": "50.9333333",
  //               "-lon": "31.5833333",
  //               "-name": "Носовка"
  //             },
  //             {
  //               "-lat": "50.594181",
  //               "-lon": "32.38689",
  //               "-name": "Прилуки"
  //             },
  //             {
  //               "-lat": "51.6463023",
  //               "-lon": "31.5616846",
  //               "-name": "Седнев"
  //             },
  //             {
  //               "-lat": "52.173561",
  //               "-lon": "32.587059",
  //               "-name": "Семёновка"
  //             },
  //             {
  //               "-lat": "51.503653",
  //               "-lon": "31.293167",
  //               "-name": "Чернигов"
  //             },
  //             {
  //               "-lat": "51.819321",
  //               "-lon": "31.94846",
  //               "-name": "Щорс"
  //             }
  //           ]
  //         },
  //         {
  //           "-name": "Черновицкая область",
  //           "city": [
  //             {
  //               "-lat": "48.38",
  //               "-lon": "25.51",
  //               "-name": "Вашковцы"
  //             },
  //             {
  //               "-lat": "48.25",
  //               "-lon": "25.1916667",
  //               "-name": "Вижница"
  //             },
  //             {
  //               "-lat": "48.1485764",
  //               "-lon": "26.2572996",
  //               "-name": "Герца"
  //             },
  //             {
  //               "-lat": "48.5166667",
  //               "-lon": "25.85",
  //               "-name": "Заставна"
  //             },
  //             {
  //               "-lat": "48.4425",
  //               "-lon": "25.7613889",
  //               "-name": "Кицмань"
  //             },
  //             {
  //               "-lat": "48.5833333",
  //               "-lon": "27.4333333",
  //               "-name": "Новоднестровск"
  //             },
  //             {
  //               "-lat": "48.2166667",
  //               "-lon": "26.2666667",
  //               "-name": "Новоселица"
  //             },
  //             {
  //               "-lat": "48.45",
  //               "-lon": "27.4166667",
  //               "-name": "Сокиряны"
  //             },
  //             {
  //               "-lat": "48.1666667",
  //               "-lon": "25.7166667",
  //               "-name": "Сторожинец"
  //             },
  //             {
  //               "-lat": "48.5",
  //               "-lon": "26.5",
  //               "-name": "Хотин"
  //             },
  //             {
  //               "-lat": "48.3",
  //               "-lon": "25.9333333",
  //               "-name": "Черновцы"
  //             }
  //           ]
  //         }
  //       ]
  //     }
  //   }
  // const regions = regionsOld.regions.region.map(yo => yo['-name']);
  // const result = {};
  // let currentRegion = regions[0];
  // let index = 0;
  // console.log('Press to ', currentRegion);
  // $('svg path').click(function() {
  //     const region = $(this).data('region')
  //     result[region] = currentRegion;
  //     console.log(result);
  //     currentRegion = regions[++index];
  //     console.log('Next Press to ', currentRegion);
  // })
});
$(document).ready(function () {
  //modal 
  $('.js-open-modal').click(function () {
    $('.js-contacts').fadeIn();
    $('.js-mask').fadeIn();
  });
  $('.js-modal-close').click(function () {
    $('.modal').fadeOut();
    $('.js-mask').fadeOut();
  });
  $('.js-mask').click(function () {
    $(this).fadeOut();
    $('.modal').fadeOut();
  });
}); // particlesJS("particles-js", {
//     "particles": {
//       "number": {
//         "value": 18,
//         "density": {
//           "enable": true,
//           "value_area": 700
//         }
//       },
//       "color": {
//         "value": ["#aa73ff", "#f8c210", "#83d238", "#33b1f8"]
//       },
//       "shape": {
//         "type": "circle",
//         "stroke": {
//           "width": 0,
//           "color": "#000000"
//         },
//         "polygon": {
//           "nb_sides": 15
//         }
//       },
//       "opacity": {
//         "value": 0.5,
//         "random": false,
//         "anim": {
//           "enable": false,
//           "speed": 1.5,
//           "opacity_min": 0.15,
//           "sync": false
//         }
//       },
//       "size": {
//         "value": 2.5,
//         "random": false,
//         "anim": {
//           "enable": true,
//           "speed": 2,
//           "size_min": 0.15,
//           "sync": false
//         }
//       },
//       "line_linked": {
//         "enable": true,
//         "distance": 110,
//         "color": "#33b1f8",
//         "opacity": 0.25,
//         "width": 1
//       },
//       "move": {
//         "enable": true,
//         "speed": 1.6,
//         "direction": "none",
//         "random": false,
//         "straight": false,
//         "out_mode": "out",
//         "bounce": false,
//         "attract": {
//           "enable": false,
//           "rotateX": 600,
//           "rotateY": 1200
//         }
//       }
//     },
//     "interactivity": {
//       "detect_on": "canvas",
//       "events": {
//         "onhover": {
//           "enable": false,
//           "mode": "repulse"
//         },
//         "onclick": {
//           "enable": false,
//           "mode": "push"
//         },
//         "resize": true
//       },
//       "modes": {
//         "grab": {
//           "distance": 400,
//           "line_linked": {
//             "opacity": 1
//           }
//         },
//         "bubble": {
//           "distance": 400,
//           "size": 40,
//           "duration": 2,
//           "opacity": 8,
//           "speed": 3
//         },
//         "repulse": {
//           "distance": 200,
//           "duration": 0.4
//         },
//         "push": {
//           "particles_nb": 4
//         },
//         "remove": {
//           "particles_nb": 2
//         }
//       }
//     },
//     "retina_detect": true
//   });

window.onload = function () {
  var c = init("pharm-animation").c,
      canvas = init("pharm-animation").canvas,
      doc = document.querySelector('body'),
      w = canvas.width = window.innerWidth,
      h = canvas.height = window.innerHeight; //initiation

  function cc(A, B, C) {
    var D = 2 * (A.x * (B.y - C.y) + B.x * (C.y - A.y) + C.x * (A.y - B.y));
    var S = {
      x: 1 / D * ((A.x * A.x + A.y * A.y) * (B.y - C.y) + (B.x * B.x + B.y * B.y) * (C.y - A.y) + (C.x * C.x + C.y * C.y) * (A.y - B.y)),
      y: 1 / D * ((A.x * A.x + A.y * A.y) * (C.x - B.x) + (B.x * B.x + B.y * B.y) * (A.x - C.x) + (C.x * C.x + C.y * C.y) * (B.x - A.x))
    };
    return S;
  }

  function dist(A, B) {
    return Math.sqrt(Math.pow(A.x - B.x, 2) + Math.pow(A.y - B.y, 2));
  }

  var point =
  /*#__PURE__*/
  function () {
    function point(x, y) {
      _classCallCheck(this, point);

      this.x = x;
      this.y = y;
    }

    _createClass(point, [{
      key: "update",
      value: function update(x, y) {
        this.x = x;
        this.y = y;
      }
    }]);

    return point;
  }();

  var triangle =
  /*#__PURE__*/
  function () {
    function triangle(A, B, C, lw) {
      _classCallCheck(this, triangle);

      this.a = A;
      this.b = B;
      this.c = C;
      this.s = cc(A, B, C);
      this.ty = this.c;
      this.lw = lw;
      this.x = dist(this.s, this.a);
      this.c1 = dist(this.a, this.b) / 2;
      this.c2 = dist(this.b, this.c) / 2;
      this.c3 = dist(this.c, this.a) / 2;
      this.a2ab = Math.atan2(this.a.y - this.b.y, this.a.x - this.b.x);
      this.a2bc = Math.atan2(this.b.y - this.c.y, this.b.x - this.c.x);
      this.a2ca = Math.atan2(this.c.y - this.a.y, this.c.x - this.a.x);
      this.rab = Math.sqrt(this.x * this.x - this.c1 * this.c1);
      this.rbc = Math.sqrt(this.x * this.x - this.c2 * this.c2);
      this.rca = Math.sqrt(this.x * this.x - this.c3 * this.c3);
      this.s1 = {
        x: this.s.x + this.rab / 2 * Math.cos(this.a2ab + Math.PI / 2),
        y: this.s.y + this.rab / 2 * Math.sin(this.a2ab + Math.PI / 2)
      };
      this.s2 = {
        x: this.s.x + this.rbc / 2 * Math.cos(this.a2bc + Math.PI / 2),
        y: this.s.y + this.rbc / 2 * Math.sin(this.a2bc + Math.PI / 2)
      };
      this.s3 = {
        x: this.s.x + this.rca / 2 * Math.cos(this.a2ca + 5 * Math.PI / 2),
        y: this.s.y + this.rca / 2 * Math.sin(this.a2ca + 5 * Math.PI / 2)
      };
    }

    _createClass(triangle, [{
      key: "update",
      value: function update(A, B, C) {
        this.a = A;
        this.b = B;
        this.c = C;
        this.s = cc(A, B, C);
        this.ty = this.c;
        this.x = dist(this.s, this.a);
        this.c1 = dist(this.a, this.b) / 2;
        this.c2 = dist(this.b, this.c) / 2;
        this.c3 = dist(this.c, this.a) / 2;
        this.a2ab = Math.atan2(this.a.y - this.b.y, this.a.x - this.b.x);
        this.a2bc = Math.atan2(this.b.y - this.c.y, this.b.x - this.c.x);
        this.a2ca = Math.atan2(this.c.y - this.a.y, this.c.x - this.a.x);
        this.rab = Math.sqrt(this.x * this.x - this.c1 * this.c1);
        this.rbc = Math.sqrt(this.x * this.x - this.c2 * this.c2);
        this.rca = Math.sqrt(this.x * this.x - this.c3 * this.c3);
        this.s1 = {
          x: this.s.x + this.rab / 2 * Math.cos(this.a2ab + Math.PI / 2),
          y: this.s.y + this.rab / 2 * Math.sin(this.a2ab + Math.PI / 2)
        };
        this.s2 = {
          x: this.s.x + this.rbc / 2 * Math.cos(this.a2bc + Math.PI / 2),
          y: this.s.y + this.rbc / 2 * Math.sin(this.a2bc + Math.PI / 2)
        };
        this.s3 = {
          x: this.s.x + this.rca / 2 * Math.cos(this.a2ca + 5 * Math.PI / 2),
          y: this.s.y + this.rca / 2 * Math.sin(this.a2ca + 5 * Math.PI / 2)
        };
      }
    }, {
      key: "move",
      value: function move(m) {
        this.c = m;
        this.s = cc(this.a, this.b, this.c);
        this.x = dist(this.s, this.a);
        this.c1 = dist(this.a, this.b) / 2;
        this.c2 = dist(this.b, this.c) / 2;
        this.c3 = dist(this.c, this.a) / 2;
        this.a2ab = Math.atan2(this.a.y - this.b.y, this.a.x - this.b.x);
        this.a2bc = Math.atan2(this.b.y - this.c.y, this.b.x - this.c.x);
        this.a2ca = Math.atan2(this.c.y - this.a.y, this.c.x - this.a.x);
        this.rab = Math.sqrt(this.x * this.x - this.c1 * this.c1);
        this.rbc = Math.sqrt(this.x * this.x - this.c2 * this.c2);
        this.rca = Math.sqrt(this.x * this.x - this.c3 * this.c3);
        this.s1 = {
          x: this.s.x + this.rab / 2 * Math.cos(this.a2ab + Math.PI / 2),
          y: this.s.y + this.rab / 2 * Math.sin(this.a2ab + Math.PI / 2)
        };
        this.s2 = {
          x: this.s.x + this.rbc / 2 * Math.cos(this.a2bc + Math.PI / 2),
          y: this.s.y + this.rbc / 2 * Math.sin(this.a2bc + Math.PI / 2)
        };
        this.s3 = {
          x: this.s.x + this.rca / 2 * Math.cos(this.a2ca + 5 * Math.PI / 2),
          y: this.s.y + this.rca / 2 * Math.sin(this.a2ca + 5 * Math.PI / 2)
        };
      }
    }, {
      key: "iterate",
      value: function iterate(it) {
        this.it = it; // this.t1 = new triangle(this.a,this.b,this.s1,this.lw/2);
        // this.t2 = new triangle(this.a,this.s2,this.c,this.lw/2);
        // this.t3 = new triangle(this.b,this.c,this.s3,this.lw/2);

        this.t4 = new triangle(this.a, this.s1, this.s3, this.lw / 2);
        this.t5 = new triangle(this.b, this.s2, this.s1, this.lw / 2);
        this.t6 = new triangle(this.c, this.s3, this.s2, this.lw / 2);
        this.t7 = new triangle(this.s1, this.s2, this.s3, this.lw / 2);

        if (it < 2) {
          // this.t1.iterate(it+1);
          // this.t2.iterate(it+1);
          // this.t3.iterate(it+1);
          this.t4.iterate(it + 1);
          this.t5.iterate(it + 1);
          this.t6.iterate(it + 1);
          this.t7.iterate(it + 1);
        } // this.t1.show();
        // this.t2.show();
        // this.t3.show();


        this.t4.show();
        this.t5.show();
        this.t6.show();
        this.t7.show();
      }
    }, {
      key: "show",
      value: function show() {
        // c.beginPath();
        // c.lineTo(this.a.x,this.a.y);
        // c.lineTo(this.b.x,this.b.y);
        // c.lineTo(this.c.x,this.c.y);
        // c.strokeStyle="white";
        // c.lineWidth=this.lw;
        // c.lineJoin="round";
        // c.closePath();
        // c.stroke();
        c.fillStyle = "white";
        c.fillRect(this.a.x - 1, this.a.y - 1, 2, 2);
        c.fillRect(this.b.x - 1, this.b.y - 1, 2, 2);
        c.fillRect(this.c.x - 1, this.c.y - 1, 2, 2);
        c.fillStyle = "#00ffff";
        c.fillRect(this.s.x - 0.5, this.s.y - 0.5, 1, 1);
        c.fillStyle = "#00ffff";
        c.fillRect(this.s1.x - 0.5, this.s1.y - 0.5, 1, 1);
        c.fillStyle = "#00ffff";
        c.fillRect(this.s2.x - 0.5, this.s2.y - 0.5, 1, 1);
        c.fillStyle = "#00ffff";
        c.fillRect(this.s3.x - 0.5, this.s3.y - 0.5, 1, 1);
      }
    }]);

    return triangle;
  }();

  var s = h / 3,
      A = new point(w / 2 + s * Math.cos(0), h / 2 + s * Math.sin(0)),
      B = new point(w / 2 + s * Math.cos(Math.PI / 3), h / 2 + s * Math.sin(Math.PI / 3)),
      C = new point(w / 2 + s * Math.cos(2 * Math.PI / 3), h / 2 + s * Math.sin(2 * Math.PI / 3)),
      D = new point(w / 2 + s * Math.cos(Math.PI), h / 2 + s * Math.sin(Math.PI)),
      E = new point(w / 2 + s * Math.cos(4 * Math.PI / 3), h / 2 + s * Math.sin(4 * Math.PI / 3)),
      F = new point(w / 2 + s * Math.cos(5 * Math.PI / 3), h / 2 + s * Math.sin(5 * Math.PI / 3)),
      G = new point(w / 2, h / 2),
      lb = 1,
      T = new triangle(A, B, G, lb),
      T2 = new triangle(B, C, G, lb),
      T3 = new triangle(C, D, G, lb),
      T4 = new triangle(D, E, G, lb),
      T5 = new triangle(E, F, G, lb),
      T6 = new triangle(F, A, G, lb),
      tx = w / 2,
      ty = h / 2,
      spd = 0;

  function draw() {
    //animation
    if (mouse.x) {
      T.move(mouse);
      T2.move(mouse);
      T3.move(mouse);
      T4.move(mouse);
      T5.move(mouse);
      T6.move(mouse);
    } else {
      T.move({
        x: tx,
        y: ty
      });
      T2.move({
        x: tx,
        y: ty
      });
      T3.move({
        x: tx,
        y: ty
      });
      T4.move({
        x: tx,
        y: ty
      });
      T5.move({
        x: tx,
        y: ty
      });
      T6.move({
        x: tx,
        y: ty
      });
      tx = w / 2 + (s * Math.cos(Math.PI / 6) - 45) * Math.cos(spd);
      ty = h / 2 + (s * Math.cos(Math.PI / 6) - 70) * Math.sin(spd);
      spd += 0.01;
    }

    T.iterate(0);
    T2.iterate(0);
    T3.iterate(0);
    T4.iterate(0);
    T5.iterate(0);
    T6.iterate(0);
    T.show();
    T2.show();
    T3.show();
    T4.show();
    T5.show();
    T6.show();
  }

  var mouse = {
    x: false,
    y: false
  };
  var last_mouse = {};
  doc.addEventListener("mousemove", function (e) {
    last_mouse.x = mouse.x;
    last_mouse.y = mouse.y;
    mouse.x = e.pageX - this.offsetLeft;
    mouse.y = e.pageY - this.offsetTop;
  }, false);
  doc.addEventListener("mouseleave", function (e) {
    mouse.x = false;
  });

  function init(elemid) {
    var canvas = document.getElementById(elemid),
        c = canvas.getContext("2d"),
        w = canvas.width = window.innerWidth,
        h = canvas.height = window.innerHeight;
    c.fillStyle = "rgba(0,0,0,1)";
    c.fillRect(0, 0, w, h);
    return {
      c: c,
      canvas: canvas
    };
  }

  function loop() {
    window.requestAnimFrame(loop);
    c.fillStyle = "rgba(0,0,0,1)";
    c.fillRect(0, 0, w, h);
    draw();
  }

  window.addEventListener("resize", function () {
    w = canvas.width = window.innerWidth, h = canvas.height = window.innerHeight;
    s = h / 3, A.update(w / 2 + s * Math.cos(0), h / 2 + s * Math.sin(0));
    B.update(w / 2 + s * Math.cos(Math.PI / 3), h / 2 + s * Math.sin(Math.PI / 3)), C.update(w / 2 + s * Math.cos(2 * Math.PI / 3), h / 2 + s * Math.sin(2 * Math.PI / 3)), D.update(w / 2 + s * Math.cos(Math.PI), h / 2 + s * Math.sin(Math.PI)), E.update(w / 2 + s * Math.cos(4 * Math.PI / 3), h / 2 + s * Math.sin(4 * Math.PI / 3)), F.update(w / 2 + s * Math.cos(5 * Math.PI / 3), h / 2 + s * Math.sin(5 * Math.PI / 3)), G.update(w / 2, h / 2), T.update(A, B, G), T2.update(B, C, G), T3.update(C, D, G), T4.update(D, E, G), T5.update(E, F, G), T6.update(F, A, G), tx = w / 2, ty = h / 2, loop();
  });
  loop();
  setInterval(loop, 1000 / 60);
};

$(document).ready(function () {
  //select 
  $('.js-select').click(function () {
    $(this).toggleClass('active');
    $('.js-select-list').slideToggle();
  }); //close custom select

  $(function ($) {
    $(document).mouseup(function (e) {
      var div = $(".js-select");

      if (!div.is(e.target) && div.has(e.target).length === 0) {
        div.removeClass('active');
        $('.js-select-list').slideUp();
      }
    });
  });
  $('.select__list li').click(function () {
    var selected = $(this).text();
    $('.select__text').text(selected);
  });
});
$(document).ready(function () {
  $('.js-vacancy-slider').slick({
    slidesToShow: 5,
    slidesToScroll: 1,
    dots: false,
    arrows: true,
    infinite: true,
    // autoplay: true,
    responsive: [{
      breakpoint: 768,
      settings: {
        slidesToShow: 1
      }
    }, {
      breakpoint: 1024,
      settings: {
        slidesToShow: 3
      }
    }, {
      breakpoint: 1360,
      settings: {
        slidesToShow: 3
      }
    }]
  }); // $('.js-vacancy-slider .slick-arrow').click(() => {
  // 	$('.vacancy-slider').addClass('bg--hidden');
  // })
  // $('.js-vacancy-slider').on('afterChange', function(event, slick, currentSlide, nextSlide){
  // 	$('.vacancy-slider').removeClass('bg--hidden');
  // });

  $('.js-news-sliser').slick({
    slidesToShow: 1,
    slidesToScroll: 1,
    dots: false,
    arrows: true,
    infinite: true,
    autoplay: true
  });
});
$(document).ready(function () {
  var svgWidth = 1049;
  var regions = {
    1: "Автономная Республика Крым",
    2: "Черкасская область",
    3: "Черниговская область",
    4: "Черновицкая область",
    5: "Днепропетровская область",
    6: "Донецкая область",
    7: "Ивано-Франковская область",
    8: "Харьковская область",
    9: "Херсонская область",
    10: "Хмельницкая область",
    12: "Киевская область",
    13: "Кировоградская область",
    14: "Луганская область",
    15: "Львовская область",
    16: "Николаевская область",
    17: "Одесская область",
    18: "Полтавская область",
    19: "Ровенская область",
    20: "Сумская область",
    21: "Тернопольская область",
    22: "Закарпатская область",
    23: "Винницкая область",
    24: "Волынская область",
    25: "Запорожская область",
    26: "Житомирская область" //tabs

  };
  $(".cart").on("click", "path:not(.active)", function () {
    var region = $(this).attr('data-region');

    var _this$getBBox = this.getBBox(),
        width = _this$getBBox.width,
        height = _this$getBBox.height;

    var _$$position = $(this).position(),
        top = _$$position.top,
        left = _$$position.left;

    var currentWidth = $('.cart').width();
    var k = svgWidth / currentWidth;
    $(this).addClass("active").siblings().removeClass("active");
    $('svg ellipse, svg circle').show();
    $("svg ellipse[data-region=\"".concat(region, "\"], svg circle[data-region=\"").concat(region, "\"]")).hide();
    $('.cart-label').show().css('left', left).css('top', top).css('width', width / k).css('height', height / k);
    $('.cart-label p').text(regions[region]);
  });
});
$(document).ready(function () {
  var rellax = new Rellax('.rellax');
  new WOW().init();
});